// let userName = 'Iryna';
// let gender= 'female';
// console.log(gender);
// let userName = prompt('Напишіть ваше ім\'я');
// alert (userName);


/* Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”;*/
let userName = prompt ('Напишіть ваше ім\'я:');
console.log(`Привіт ${userName}`);



/* Запитай рік народження користувача, порахуй його/її вік і виведи результат. Поточний рік вкажи в коді як константу;*/
const Year = 2022;
let userAge = prompt (`Вкажіть ваш рік народження:`);
console.log(Year-userAge);

 
 
/* Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата*/
let answerTheQuestion = prompt (`Вкажіть в см довжину сторони квадрата, а ми порахуємо вам периметр`);
console.log(4*answerTheQuestion);



/* Запитай у користувача радіус кола і виведи площу такої окружності.*/
let radius = prompt (`Вкажіть радіус кола`);
console.log(3.14 * Math.pow(radius,2));


/* Запитай у користувача відстань в кілометрах між двома містами і за скільки годин він хоче дістатися. Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно.*/
let distance = prompt ('Вкажіть відстань між містами а і б в км:');
let time = prompt ('За скільки годин ви хочете добратись?');
console.log(distance / time);


/* Реалізуй конвертор валют. Користувач вводить долари, програма переводить їх в євро. Курс валют зберігається в константі.*/
let moneyDollar = prompt ('Введіть певну суму в $:');
const moneyEuro = 0.93;
console.log(moneyDollar * 0.93);








/*Типи даних та оператори
 Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.*/
let sum =(0.1 + 0.2);
console.log(sum.toFixed(1));


/* Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.*/
let x = '1' ;
let y = 2;
console.log(!!x + y);


/* Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.*/
let flashMemory = prompt ('обсяг памяті вашої флешки в Гб:');
console.log(Math.floor(flashMemory / 0.82));




/* Користувач вводить суму грошей в гаманці і ціну однієї шоколадки. Програма виводить скільки шоколадок може купити користувач і скільки здачі у нього залишиться.*/
let money = prompt ('сума грошей в гаманці');
let price = prompt ('ціна однієї шоколадки');
console.log(Math.floor(money / price));
console.log((money % price).toFixed());



/* Запитай у користувача тризначне число і виведи його задом наперед. Для вирішення завдання тобі знадобиться оператор% (залишок від ділення)*/
let chislo = prompt('вкажіть тризначне число');
alert((' ' + chislo).split('').reverse().join(''));


/* Користувач вводить суму вкладу в банк на 2 місяці, з процентною ставкою депозиту 5% річних. Вивести суму нарахованих відсотків.*/
let moneyBank = prompt ('ввeсти суму вкладу в банк на 2 місяці'); 
console.log((Math.floor((moneyBank * 0.05) / 12)) * 2);


// Що повернуть вираження:
//  2 && 0 && 3   якщо всі значення виконюються як true то вернеться true
// 
//  2 || 0 || 3 
// 
// 2 && 0 || 3


// обєкти
// / *Мінімум
// Створи об'єкт, що описує автомобіль (виробник, модель, рік випуску, середня швидкість, обсяг паливного бака, середня витрата палива на 100 км., водії), і наступні функції для роботи з цим об'єктом:
// Висновок на екран з інформацією про автомобіль.
// Додавання водія, який має право керувати автомобілем.
// Заправка автомобіля.
//  Підрахунок необхідного часу для подолання переданої відстані з середньою швидкістю. Враховуй, що через кожні 4 години дороги водієві необхідно робити перерву на 1 годину, а також потрібно перевіряти чи має право водій керувати даним автомобілем (ім'я водія функція приймає другим аргументом). Також потрібно перевірити чи вистачить палива, для здійснення цієї поїздки, якщо палива не вистачить потрібно вивести повідомлення, про це і запропонувати заправити автомобіль.*\
// const driver3 = 'third driver';
// const car = {
//   producer: 'Renault',
//   model: 'scenic',
//   year: '2012',
//   speed: '100',
//   fuelTank: '50',
//   fuelConsumption: '7',
//   drivers: {
//     wife: 'first driver',
//     husband: 'second driver',
//   }
// }
// console.log(car);





// 
// Норма
// 
// Створити об'єкт, що описує час (години, хвилини, секунди), і такі функції для роботи з цим об'єктом:
// Для виведення часу на екран.
// Зміни часу на передане кількість секунд.
// Зміни часу на передане кількість хвилин.
// Зміни часу на передане кількість годин.
// Врахуйте, що в останніх 3-х функціях, при зміні однієї частини часу, може змінитися і інша. Наприклад: якщо до часу «20:59:45» додати 30 секунд, то повинно вийти «21:00:15», а не «20:30:75». Також потрібно передбачити можливість того що користувач може передати 150 секунд, або 75 хвилин.
// Максимум
// 
// Створи об'єкт, що описує звичайний дріб. Створи об'єкт, який має методи роботи з дробом:
// Складання 2-х об'єктів-дробів.
// Віднімання 2-х об'єктів-дробів.
// Множення 2-х об'єктів-дробів.
// Ділення 2-х об'єктів-дробів.
// Скорочення об'єкта-дробу.
// (Тобі потрібно буде створити ще деякі методи не зазначені в завданні, для отримання математично правильної відповіді)
// 


/* Цикли */
/* Запитай у користувача його вік і визначи, ким він є: дитиною (0-11), підлітком (12-17), дорослим (18_59) або пенсіонером (60 ...), передбач можливість введення невірних даних. */
let userAgeDifferent = prompt ('Вкажіть ваш вік:'); 
if (userAgeDifferent > 0 && userAgeDifferent  <= 11) {
	alert('дитина');
} else if (userAgeDifferent >= 12 && userAgeDifferent  <= 17)  { 
  alert('підліток');
} else if (userAgeDifferent >= 18 && userAgeDifferent  <= 59) {
  alert('дорослий');
} else if (userAgeDifferent >= 60) {
  alert('пенсіонер');
} else {
  alert('ти людина?');
}


// Запитай у користувача число від 0 до 9 і виведи йому спецсимвол, який розташований на цій клавіші (1 !, 2 @, 3 # і т. д).
const arrayOfSymbols = [ ')', '!', '@', '#', '$', '%', '^', '&', '*', '(',];
 let numberAsk = prompt ('Скажіть цифру від 0-9:');
 alert(arrayOfSymbols[numberAsk]);


// Підрахуй суму всіх чисел в заданому користувачем діапазоні.

// Запитай у користувача 2 числа і знайди найбільший спільний дільник.
// let numberOneDivisor  = prompt ('Вкажіть цифру');
// let numberTwoDivisor  = prompt ('Вкажіть ще одну цифру');

// Запитай у користувача число і виведи всі дільники цього числа.
// let numberOneAnswear = prompt ('Вкажіть цифру');

// Запитай у користувача п’ятирозрядне число і визначи, чи є воно паліндромом.
// 
// Запитай у користувача суму покупки і виведи суму до оплати зі знижкою:
// від 200 до 300 - знижка буде 3%; 
// від 300 до 500 - 5%;
// від 500 і вище - 7%.
// 
// Запитай у користувача 10 чисел і порахуй, скільки він ввів додатніх, від’ємних і нулів. При цьому також порахуй, скільки з них парних і непарних. Виведи статистику на екран. Враховуй, що достатньо однієї змінної (не 10) для введення чисел користувачем.
// Зацикли відображення днів тижня таким чином: «День тижня. Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.
// Максимум
// 
// Гра «Вгадай число». Запропонуй користувачеві загадати число від 0 до 100 і відгадай його наступним способом: кожну ітерацію циклу діли діапазон чисел навпіл, записуй результат в N і питай у користувача «Ваше число> N, <N або == N?». Залежно від того що вказав користувач, зменшуй діапазон. Початковий діапазон від 0 до 100, поділи навпіл і отримай 50. Якщо користувач вказав, що його число> 50, то зміни діапазон на від 50 до 100. І так до тих пір, поки користувач не вибере == N (буде корисним почитати про алгоритм: "бінарний пошук").
// Виведи таблицю множення для всіх чисел від 2 до 9. Кожне число необхідно помножити на числа від 1 до 10.
// Запитай дату (день, місяць, рік) і виведи наступну за нею дату. Враховуй можливість переходу на наступний місяць, рік, а також високосний рік.
// 
// 
// Мінімум
// 
// Напиши всі можливі варіанти створення функцій.
// Створи функцію, яка буде виводити кількість переданих їй аргументів.
// Напиши функцію, яка приймає 2 числа і повертає :
// -1, якщо перше число менше, ніж друге; 
// 1 - якщо перше число більше, ніж друге; 
// 0 - якщо числа рівні.
// Напиши функцію, яка обчислює факторіал переданого їй числа.
// Напиши функцію, яка приймає три окремі цифри і перетворює їх в одне число. Наприклад: цифри 1, 4, 9 перетворяться в число 149.
// Напиши функцію, яка приймає довжину і ширину прямокутника і обчислює його площу. Якщо в функцію передали 1 параметр, то вона обчислює площу квадрата.
// Норма
// 
// Напиши функцію, яка перевіряє, чи є передане їй число “досконалим числом”. Досконале число - це число, яке дорівнює сумі всіх своїх дільників.
// Напиши функцію, яка приймає мінімальне і максимальне значення для діапазону, і виводить тільки ті числа з діапазону, які є досконалими. Використовуй написану раніше функцію, щоб дізнатися, чи є це число досконалим.
// 
// 
// Мінімум
// 
// Створи об'єкт, що описує автомобіль (виробник, модель, рік випуску, середня швидкість, обсяг паливного бака, середня витрата палива на 100 км., водії), і наступні функції для роботи з цим об'єктом:
// Висновок на екран з інформацією про автомобіль.
// Додавання водія, який має право керувати автомобілем.
// Заправка автомобіля.
// Підрахунок необхідного часу для подолання переданої відстані з середньою швидкістю. Враховуй, що через кожні 4 години дороги водієві необхідно робити перерву на 1 годину, а також потрібно перевіряти чи має право водій керувати даним автомобілем (ім'я водія функція приймає другим аргументом). Також потрібно перевірити чи вистачить палива, для здійснення цієї поїздки, якщо палива не вистачить потрібно вивести повідомлення, про це і запропонувати заправити автомобіль.
// Норма
// 
// Створити об'єкт, що описує час (години, хвилини, секунди), і такі функції для роботи з цим об'єктом:
// Для виведення часу на екран.
// Зміни часу на передане кількість секунд.
// Зміни часу на передане кількість хвилин.
// Зміни часу на передане кількість годин.
// Врахуйте, що в останніх 3-х функціях, при зміні однієї частини часу, може змінитися і інша. Наприклад: якщо до часу «20:59:45» додати 30 секунд, то повинно вийти «21:00:15», а не «20:30:75». Також потрібно передбачити можливість того що користувач може передати 150 секунд, або 75 хвилин.
// Максимум
// 
// Створи об'єкт, що описує звичайний дріб. Створи об'єкт, який має методи роботи з дробом:
// Складання 2-х об'єктів-дробів.
// Віднімання 2-х об'єктів-дробів.
// Множення 2-х об'єктів-дробів.
// Ділення 2-х об'єктів-дробів.
// Скорочення об'єкта-дробу.
// (Тобі потрібно буде створити ще деякі методи не зазначені в завданні, для отримання математично правильної відповіді)
// 
// 
// Мінімум
// 
// Створи масив «Список покупок». Кожен елемент масиву є об'єктом, який містить назву продукту, кількість і куплений він чи ні, ціну за одиницю товару, сума. Написати кілька функцій для роботи з таким масивом:
// Виводити весь список на екран таким чином, щоб спочатку йшли продукти, що ще не придбані, а потім - ті, що вже придбали.
// Покупка продукту. Функція приймає назву продукту і відзначає його як придбаний.
// Створення списку (не) придбаних продуктів.
// Норма
// 
// Видалення продукту зі списку (видалення повинно проводитися шляхом створення нового масиву, в якому продукт, що ми шукаємо, буде відсутнім)
// Додавання покупки в список. Враховуй, що при додаванні покупки з уже існуючим в списку продуктом, необхідно збільшувати кількість в існуючій покупці, а не додавати нову. При цьому також повинна змінитися сума, наприклад, якщо ціна за одиницю 12, а кількості товарів стало 2, то сума буде 24.
// Максимум
// 
// Підрахунок суми всіх продуктів (враховуючи кількість кожного) в списку.
// Підрахунок суми всіх (не) придбаних продуктів.
// Показання продуктів в залежності від суми, (від більшого до меншого / від меншого до більшого, в залежності від параметра функції, який вона приймає